---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures
source: html/ce8947c8-f0b5-7fbb-9e51-32a54d75b781.htm
---
# BuiltInFailures.EnergyAnalysisFailures Properties

The setting for calculation of Volume Computations is not on. The analysis model produced will be approximate without the computation of Areas and Volumes